# TonnesForcePerMeter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..TonnesForcePerMeter Property
UnitTypeId Class See Also
---
Tonnes force per meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId TonnesForcePerMeter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TonnesForcePerMeter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TonnesForcePerMeter {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace